from random import randint

#Weapon
classes_1 = ["default", "common", "uncommon",
           "rare", "epic", "mythical",
           "legendary", "godly", "secret"]

type_weapon = ["Bow", "Sword", "Shield",
          "Spear", "Staff", "Hammer"]

specification = {"common": ["Старый лук", "Ржавый меч", "Поломанный щит",
        "Деревянное копьё", "Иссякший посох", "Разбитый молот"],
        "uncommon": ["Потёртый лук", "Затупленный меч", "Потресканый щит",
        "Затупленное копьё", "Поломанный посох", "Побитый молот"],
        "rare": ["Обычный лук", "Обычный Меч", "Обычный щит",
        "Обычное копьё", "Обычный посох", "Обычный молот"],
        "epic": ["Хороший лук", "Заточенный меч", "Прочный щит",
        "Острое копьё", "Улучшенный посох", "Большой молот"],
        "mythical": ["Зачарованный лук", "Мифриловый мечь", "Укреплённый щит",
        "Обсидиановое копьё", "Двухкратный посох", "Титановый молот"]}

legendary_spec = {"B1": "Лук лук", "B2": "Лук героя Эстароса", "B3": "Двуликий лук мразота",
                          "Sw4": "Экскалибур", "Sw5": "Мечь из Адамантита", "Sw6": "Легендарный мечь Момона",
                          "Sh7": "Панцерь черепахи", "Sh8": "Щит правосудья", "Sh9": "Несокрушимый",
                          "Sp10": "Рейнхардское копьё", "Sp11": "Копьё пылающих сердец", "Sp12": "Копьё безумия",
                          "St13": "Посох друида", "St14": "Посох бедствий", "St15": "Посох всех стихий",
                          "H16": "Везучий молот", "H17": "Ревущий молот", "H18": "Титаник"}

godly_spec = {"B19": "Лук пронзающий небеса", "B20": "Авангард когтей", "B21": "Звездопад",
                      "Sw22": "Рождённый в аду", "Sw23": "Убийца богов", "Sw24": "Рождённый светом",
                      "Sh25": "Ракировка", "Sh26": "Бэдрок", "Sh27": "1000 Рукая Будда",
                      "Sp28": "Падающии листья сакуры", "Sp29": "Достигаюший цели", "Sp30": "Пархание бабочки",
                      "St31": "Эйфория", "St32": "Чёрная дыра", "St33": "Плачь богини",
                      "H34": "Удары короля", "H35": "Чуство вины", "H36": "Землетряс"}

secret_spec = {1: "Эсканор", 2: "Рефлексы чёрного бога", 3: "Дыры самой сути", 4: "Чёрная смерть", 5: "Катастрофа", 6: "Старанные часы", 7: "Бесконечный спин"}
secret_type = {"Revolver": randint(8, 15)}

#items
secret_items = ["Говно Карабая", "Дыхание в банке Карабая", "Колба с мочёй Карабая",
                "Ошейник Карабая", "Статуетка Карабая", "Когти Карабая", "Шерсть Карабая"]
godly_items = ["Вечная расческа Акоди", "Книга все мудрости", "База по русскому языку",
               "Белая Мусорка", "Вечно крутящийся шар", "Рукоять природы", "Кристалл разрыва вселенной"]
legendary_items = ["Изящная хрустальный шар с маленьким лесом внутри", "Зеркало правды", "Дух в лампе",
                   "Радужная кость", "Виниловый диск", "Карманные часы путника", "Чёрный блокнот"]
mythical_items = ["Странный ключь", "Кусочек пластелина", "Ожерелье хаоса",
                  "Супер сжатое облако", "Самый первый курт в мире", "Вечный факел", "Виниловый проигрыватель"]
epic_items = ["Крыло Виверны", "Глаз Орка", "Ядро Голема",
              "Древний свиток", "Лепестки чёрной розы", "Частичка плаща Лича", "Проклятое кольцо"]
rare_items = ["Панцерь черепахи", "Пепел душ", "Моток шелковистой паутины",
              "Маленький осколок изумруда", "Слиток золота", "Плоть мертвеца", "Кремень"]
uncommon_items = ["Кусочек золота", "Железный стилок", "Медный слиток",
                  "Семена", "Кусочек Железа", "Стрелы", "Кожа"]
common_items = ["Бревно", "Сломанный обломок", "Большой кусок камня",
                "Куча мусора", "Моток верёвки", "Сломанная Рукоять", "Кусочек Меди"]

#food
food_list_1 = {"Сырая картошка": 1, "Гоголь моголь": 4, "Сырая морковь": 1, "Сырая баранина": 3, "Сырая говядина": 3,
"Бутылка воды": 1, "Курт": 1, "Помидор": 1, "Огурец": 1, "Трава": 1}
food_list_2 = {"Суп": 6, "Варенная картошка": 6, "Варенная морковь": 6, "Кусок хлеба": 5, "Варенные яйца": 5,
"Тарелка риса": 7, "Спагетти": 7, "Рожок мороженного": 6, "Тарелка гречки": 7, "Рожки": 5}
food_list_3 = {"Бешпармак": 10, "Манты": 11, "Самса": 11, "Лагман": 10, "Жем": 9,
"Чебуреки": 9, "Ростишка": 11, "Золотая морковка": 12, "Биг Бон": 12, "Кумыс": 13}
food_list_4 = {"Бутерброды": 100, "Стейк": 100, "Фитучини": 100, "СУПЕР ПУПЕР КОФЕ": 100, "Шашлык из утки": 100,
"Суши": 100, "Сосиски в тесте": 100, "Мамены мини-перожки": 100, "Пицца": 101, "Оливье": 102}
secret_food = ["Божественный салат из говна Карабая", "Дыхание Карабая", "Doshick"]

#money
coins = [1, 3, 5, 10, 20, 50, 100]
money_paper = [200, 500, 1000, 2000, 5000, 10000, 15000]

#city
shop_catalog = ["|Оружие->1|", "|Предметы->2|", "|Еда->3|", "|Другое->4|"]
catalog_price = [3, 6, 10, 16, 30, 70, 150, 993]
